#База знаний. Полная и с разбалловкой
SPORT_RULES = {
    "Футбол": {
        "keywords": [
            # общительный
            "общительный", "экстраверт", "коммуникабельный", "легко сходящийся с людьми", "открытый в общении", "в центре внимания",
            
            # Смелый
            "смелый", "уверенный в себе", "решительный", "отважный", "не боится вызовов",
            
            # инициативный
            "инициативный", "активный", "находчивый",
            
            # эмоционально устойчивый
            "эмоционально устойчивый", "стрессоустойчивый", "спокойный под давлением", 
           
            # Открытый к командной работе
            "открытый к командной работе", "командный", "работает в коллективе", "поддерживает партнёров", "командный игрок", "умеющий взаимодействовать",
          
            # целеустремленный
            "целеустремлённый", "мотивированный", "стремится к победе", "упорный", "любит соревноваться", "настойчивый", "амбициозный",
            
            # склонный к риску
            "склонный к риску", "авантюрный", "любящий вызовы",

            # ответственный
            "ответственный", "надёжный", "добросовестный",

            # Эмпатия
            "эмпатичный", "чувствует команду", "сопереживает", "чуткий", "понимающий",
        ],
    },


    "Гандбол": {
        "keywords": [
            # Общительный
            "общительный", "коммуникабельный", "открытый в общении",

            # Умеет работать в команде
            "командный", "работает в коллективе", "слушает партнёров",

            # Энергичный
            "энергичный", "активный", "подвижный",  "любит движение", "динамичный", "быстрый", "ловкий",

            # Решительный
            "решительный", "смелый в выборе", "волевой",
            
            # Эмоционально устойчив
            "эмоционально устойчив", "стрессоустойчивый", "спокойный под давлением", "сохраняет концентрацию", "устойчивый к стрессу",
            
            # Целеустремлённый
            "целеустремлённый", "амбициозный", "не боится трудностей",
            
            # Трудолюбивый
            "трудолюбивый", "усердный", "старательный",
            
            # Стойкий
            "стойкий", "выносливый", "упорный",
            
            # неконфликтный
            "неконфликтный", "избегает агрессии", "сдержанный"

        ],
    },



    "Водное поло": {
        "keywords": [

            # Общительный
            "общительный", "коммуникабельный", "легко идёт на контакт",

            # стрессоустойчивый
            "стрессоустойчивый", "хладнокровный", "устойчивый к давлению", "владеет собой под давлением", "не паникует",

            # Реалистично оценивает свои силы
            "реалистично оценивает свои силы", "обладает адекватной самооценкой", "трезво смотрит на свои возможности", "реалистично оценивает себя", "знает свои силы", "самосознающий", "адекватная самооценка",
            
            # Настойчивый
            "волевой", "настойчивый", "упорный", "целеустремлённый", "стойкий",
            
            # дисциплинированный
            "дисциплинированный", "организованный", "собранный",
            
            # Целеустремлённый
            "амбициозный", "мотивированный на достижение", "идущий к поставленной цели",
          
            # внимательный
            "внимательный", "наблюдательный", "сосредоточенный",
    
            
            # сообразительный
            "сообразительный", "находчивый", "проницательный",
            
        ],
    },


    "Волейбол": {
        "keywords": [
            # Коммуникабельный
            "коммуникабельный", "общительный", "открытый в общении",

            # активный
            "активный", "энергичный", "динамичный",

            # уравновешенный
            "уравновешенный", "эмоционально стабильный", "спокойный","стрессоустойчивый", "владеет эмоциями", "не сбивается после ошибки",

            # инициативный
            "инициативный", "предприимчивый", "находчивый",

            # Оптимистичный
            "оптимистичный", "жизнерадостный", "позитивно настроенный", "уверенный в успехе", "бодрый духом",

            # дисциплинированный
            "дисциплинированный", "собранный", "ответственный",

            # командный
            "командный", "сплочённый", "кооперативный",
           
            # адаптивный
            "адаптивный", "гибкий", "легко осваивающий новое", "переключается быстро", "меняет роль мгновенно", "тактически гибкий",
                   
            # упорный
            "упорный", "целеустремлённый", "терпеливый", "не сдающийся перед трудностями", "настойчивый", 
           
            # Умеет управлять эмоциями
            "умеет управлять эмоциями",  "сдержанный ", 

            # трудолюбивый
            "трудолюбивый", "усердный", "работоспособный", "старательный", "преданный делу"
        ],
    },



    "Плавание": {
        "keywords": [
           # предпочитает индивидуальную работу
            "предпочитает индивидуальную работу", "самодостаточный", "независимый в действиях", "ориентированный на личный результат", "способный работать в одиночку",

            # эмоционально уравновешенный
            "эмоционально уравновешенный", "сдержанный", "спокойный", "самоконтроль", "владеет собой",

            # Дисциплинированный
            "дисциплинированный", "собранный", "организованный",

            # терпеливый
            "терпеливый", "выносливый", "упорный в монотонной работе", "устойчив к рутине", 

            # увлечённый
            "увлечённый", "преданный делу", "мотивированный",

            # целеустремлённый
            "целеустремлённый", "волевой", "идущий к поставленной цели",
           
            # Интроверт
            "замкнутый", "внутренний мир", "сосредоточен на себе",
            
            # Мотивация
            "внутренняя мотивация", "мотивирован изнутри", "не нуждается в одобрении", "работает ради себя"
        ],
        
    },


    "Фигурное катание": {
        "keywords": [
            # умеет фокусироваться
            "умеет фокусироваться", "сконцентрированный", "концентрация", "фокус", "сосредоточенный", "внимание", "погружён в задачу",

            # эмоционально устойчив
            "эмоционально устойчив", "выдержанный", "спокойный под давлением", "стрессоустойчивый", "выступает под давлением", "публично устойчивый", "внешне сдержан", "контролирует проявления", 

            # внимательный
            "внимательный", "наблюдательный", "чуткий к деталям", "проницательный",

            # сдержанный
            "сдержанный", "владеющий собой", "эмоционально регулируемый", "собранный",

            # стойкий
            "стойкий", "выносливый", "упорный", "терпеливый", "не отступающий перед трудностями",

            # дисциплинированный
            "дисциплинированный", "организованный", "системный", "методичный", "следует плану",

            # трудолюбивый
            "трудолюбивый", "усердный", "работоспособный",

            # комфортно чувствует себя на публике
            "комфортно чувствует себя на публике", "выразительный в рамках","уверенный в выступлениях", "харизматичный на публике", "харизматичный",

            # предпочитает стабильность
            "предпочитает стабильность", "стабильный", "предпочитает порядок", "не любит импровизацию", "планирует заранее", "последовательный",

            # организованный
            "структурированный", "упорядоченный", "методичный", "собранный"

            # предпочитает планирование
            "предпочитает планирование", "предусмотрительный", "расчётливый", "системно мыслящий", "заранее продумывающий шаги"
        ],
    },


    "Тяжелая атлетика": {
        "keywords": [
            # эмоционально устойчивый
            "эмоционально устойчивый", "стрессоустойчивый", "уравновешенный", "спокойный под нагрузкой", "эмоционально стабильный", "рассудительный",
            
            # добросовестный
            "добросовестный", "ответственный", "исполнительный", "порядочный в делах",
            
            # cамодисциплинированный
            "cамодисциплинированный", "организованный", "собранный",
           
            # целеустремлённый
            "целеустремлённый", "амбициозный", "волевой", "мотивированный",
            
            # сконцентрированный
            "сконцентрированный", "концентрация", "сосредоточенный", "умеющий фокусироваться", "фокус на одном", "методичный", "терпеливый",

            # упорный
            "упорный", "стойкий", "несгибаемый", "сила воли", "не сдаётся", "преодолевает", "решительный"
            
        ],
    },



    "фехтование": {
        "keywords": [
            # креативный
            "креативный", "изобретательный", "нестандартно мыслящий", "с богатым воображением", "находчивый",

            # склонен экспериментировать
            "склонен экспериментировать", "открытый новому", "ищущий нестандартные решения", "готовый к пробным действиям", "исследовательски настроенный",

            # гибкий в принятии решений
            "гибкий в принятии решений", "адаптивный", "быстро ориентирующийся", "оперативно реагирующий на изменения", "способный менять тактику",

            # ответственный
            "ответственный", "надёжный", "добросовестный", "исполнительный", "сознательный",

            # обладает высоким самоконтролем
            "обладает высоким самоконтролем", "сдержанный", "эмоционально регулируемый", "собранный",

            # настойчивый
            "настойчивый", "упорный", "целеустремлённый",

            # артистичный
            "артистичный", "выразительный", "обладающий эстетическим чувством", "изящный в движениях", "сценически одарённый",

            # внимательный
            "внимательный", "наблюдательный", "бдительный", "сосредоточенный на деталях", "проницательный",

            # эмоционально устойчив
            "эмоционально устойчив", "стрессоустойчивый", "спокойный под давлением",

            # аналитичный
            "аналитичный", "логически мыслящий", "рассудительный", "умеющий разбирать ситуацию на составляющие", "системно анализирующий",

            # стратегически мыслящий
            "стратегически мыслящий", "дальновидный", "планирующий на несколько шагов вперёд", "предусмотрительный", "расчётливый",

            # смелый
            "смелый", "отважный", "бесстрашный", "решительный", "не боящийся вызовов",

            # авантюрный
            "авантюрный", "склонный к рискованным решениям", "любящий острые ощущения", "смелый в экспериментах", "готовый идти на обоснованный риск",

            # инициативный
            "инициативный", "активный", "предлагающий новые идеи",
        ],
    },

    
    
    
    "шахматы": {
        "keywords": [
            # спокойный
            "спокойный", "уравновешенный", "сдержанный", "невозмутимый",

            # аналитичный
            "аналитичный", "логически мыслящий", "проницательный", "системный в оценках",

            # стратегически мыслящий
            "стратегически мыслящий", "дальновидный", "планирующий на много ходов вперёд", "предусмотрительный", "расчётливый",

            # усидчивый
            "усидчивый", "устойчивый к длительной работе", "терпеливый к монотонности", "способный к длительной концентрации", "выносливый в умственной работе",

            # эмоционально устойчивый
            "эмоционально устойчивый", "стрессоустойчивый", "сохраняющий самообладание", "спокойный под давлением",

            # сосредоточенный
            "сосредоточенный", "сконцентрированный", "умеющий фокусироваться", "погружённый в задачу",

            # организованный
            "организованный", "систематический", "структурированный", "методичный", "соблюдающий порядок",

            # терпеливый
            "терпеливый", "выносливый",

            # рациональный
            "рациональный", "логичный", "объективный", "основывающийся на фактах",

            # рассудительный
            "рассудительный", "вдумчивый", "осмотрительный",

            # осторожный
            "осторожный", "предусмотрительный", "бдительный",

            # сосредоточен на внутреннем процессе
            "сосредоточен на внутреннем процессе", "интровертный в мышлении", "погружённый в размышления", "концентрированный на анализе"
        ],
    },
    
    
    "хоккей": {
        
        "keywords": [
            # эмоционально устойчивый
            "эмоционально устойчивый", "стрессоустойчивый", "спокойный в сложных ситуациях",

            # сосредоточенный
            "сосредоточенный", "сконцентрированный", "умеющий фокусироваться", "внимательный к процессу",

            # внимательный
            "внимательный", "наблюдательный", "бдительный",

            # проницательный
            "проницательный", "сообразительный", "быстро оценивающий ситуацию",

            # решительный
            "решительный", "непоколебимый", "смелый в выборе",

            # смелый
            "смелый", "не боящийся столкновений",

            # настойчивый
            "настойчивый", "упорный", "целеустремлённый", "твёрдо идущий к цели",

            # инициативный
            "инициативный", "активный",

            # обладает высокой выдержкой
            "обладает высокой выдержкой", "стойкий",

            # командный
            "командный", "ориентированный на коллективные цели", "умеющий взаимодействовать", "сплочённый", "партнёрский", "командный игрок"
        ],
    },


    "теннис": {
        "keywords": [
            # коммуникабельный
            "коммуникабельный", "общительный", "легко идёт на контакт", "открытый в общении",

            # эмоционально устойчивый
            "эмоционально устойчивый", "стрессоустойчивый", "спокойный под давлением",

            # рассудительный
            "рассудительный", "вдумчивый", "осмотрительный", "взвешивающий решения",

            # упорный
            "упорный", "настойчивый", "стойкий", "не сдающийся перед трудностями",

            # умеет владеть собой
            "умеет владеть собой", "сдержанный", "собранный",

            # целеустремлённый
            "целеустремлённый", "нацеленный на результат", "амбициозный", "мотивированный", "волевой",

            # решительный
            "решительный", "твёрдый в решениях", "смелый в действиях",

            # ответственный
            "ответственный", "надёжный", "добросовестный",

            # рациональный
            "рациональный", "логичный", "рассудочный",

            # организованный
            "организованный", "систематический", "структурированный", "методичный"
        ],
    },



    "конный спорт": {
        "keywords": [
            # самостоятельный
            "самостоятельный", "независимый в решениях", "умеющий действовать в одиночку",

            # уравновешенный
            "уравновешенный", "эмоционально стабильный", "спокойный", "сдержанный",

            # рассудительный
            "рассудительный", "вдумчивый", "осмотрительный",

            # независимый
            "независимый", "самостоятельный в суждениях",

            # стрессоустойчивый
            "стрессоустойчивый", "сохраняющий самообладание", "устойчивый к давлению",

            # обладающий самоконтролем
            "обладающий самоконтролем", "дисциплинированный", "умеющий регулировать эмоции",

            # способен к глубокому партнёрскому взаимодействию с животным
            "способен к партнёрскому взаимодействию с животным", "эмпатичный к животному", "умеющий выстраивать доверительные отношения",

            # ответственный
            "ответственный", "надёжный", "добросовестный", "сознательный",

            # открытый
            "открытый", "дружелюбный", "коммуникабельный", "располагающий к себе", "искренний",

            # решительный
            "решительный", "твёрдый в действиях", "смелый в принятии решений", "непоколебимый", "быстро реагирующий"
        ],
    },

}