# База знаний. Полная и с разбалловкой
SPORT_RULES = {
    "Футбол": {
        "max_score": 65,
        "keywords": {
            # общительный
            "общительный": 2,
            "легко заводит знакомства": 2,
            "открытый к новым людям": 2,
            "не стесняется в компании": 2,
            "любит общение": 2,
            "социальный": 2,
            "коммуникабельный": 2,
            "умеет находить общий язык": 2,
            "легко находит подход к другим": 2,
            "хорошо взаимодействует с окружающими": 2,
            "легко сходящийся с людьми": 2,
            "быстро находит общий язык": 2,
            "адаптируется в новой компании": 2,
            "открытый в общении": 2,
            "в центре внимания": 3,
            "любит быть на виду": 3,
            "стремится к лидерству в группе": 3,


            # Смелый
            "смелый": 2,
            "бесстрашный": 2,
            "готов идти на риск": 2,
            "уверенный в себе": 2,
            "верит в свои силы": 2,
            "решительный": 1,
            "действует без промедления": 1,
            "не колеблется в критический момент": 1,
            "отважный": 2,
            "храбрый": 2,
            "идёт навстречу опасности": 2,
            "не боится вызовов": 2,
            "не избегает сложных задач": 2,

            # инициативный
            "инициативный": 1,
            "предлагает идеи первым": 1,
            "активный": 1,
            "энергичный": 1,
            "находчивый": 2,
            "быстро находит выход из ситуации": 2,

            # эмоционально устойчивый
            "эмоционально устойчивый": 1,
            "сохраняет самообладание": 1,
            "не поддаётся панике": 1,
            "стрессоустойчивый": 1,
            "не теряет контроль в стрессе": 1,
            "спокойный под давлением": 1,
            "устойчив к внешнему давлению": 1,

            # Открытый к командной работе
            "открытый к командной работе": 2,
            "командный": 1,
            "готов сотрудничать": 2,
            "работает в коллективе": 1,
            "поддерживает партнёров": 2,
            "командный игрок": 2,
            "умеющий взаимодействовать": 2,
            "думает о других, а не только о себе": 2,

            # целеустремленный
            "целеустремлённый": 1,
            "мотивированный": 1,
            "стремится к победе": 3,
            "упорный": 1,
            "любит соревноваться": 3,
            "настойчивый": 1,
            "амбициозный": 1,

            # склонный к риску
            "склонный к риску": 2,
            "авантюрный": 3,
            "любящий вызовы": 2,

            # ответственный
            "ответственный": 1,
            "надёжный": 1,
            "добросовестный": 1,

            # Эмпатия
            "эмпатичный": 2,
            "чувствует команду": 2,
            "сопереживает": 2,
            "чуткий": 2,
            "понимающий": 2,
        }
    },



    "Гандбол": {
        "max_score": 60,
        "keywords": {
            # Общительный
            "общительный": 2,
            "коммуникабельный": 2,
            "открытый в общении": 2,

            # Умеет работать в команде
            "командный": 1,
            "работает в коллективе": 1,
            "слушает партнёров": 2,

            # Энергичный
            "энергичный": 2,
            "активный": 1,
            "подвижный": 2,
            "любит движение": 2,
            "динамичный": 2,
            "быстрый": 2,
            "ловкий": 2,

            # Решительный
            "решительный": 1,
            "смелый в выборе": 2,
            "волевой": 2,

            # Эмоционально устойчив
            "эмоционально устойчив": 1,
            "стрессоустойчивый": 1,
            "спокойный под давлением": 1,
            "сохраняет концентрацию": 2,
            "устойчивый к стрессу": 1,

            # Целеустремлённый
            "целеустремлённый": 1,
            "амбициозный": 1,
            "не боится трудностей": 2,

            # Трудолюбивый
            "трудолюбивый": 1,
            "усердный": 1,
            "старательный": 1,

            # Стойкий
            "стойкий": 1,
            "выносливый": 1,
            "упорный": 1,

            # неконфликтный
            "неконфликтный": 3,
            "избегает агрессии": 3,
            "сдержанный": 1,
        }
    },
    "Водное поло": {
        "max_score": 60,
        "keywords": {
            # Общительный
            "общительный": 2,
            "коммуникабельный": 2,
            "легко идёт на контакт": 2,

            # стрессоустойчивый
            "стрессоустойчивый": 1,
            "хладнокровный": 2,
            "устойчивый к давлению": 2,
            "владеет собой под давлением": 2,
            "не паникует": 2,

            # Реалистично оценивает свои силы
            "реалистично оценивает свои силы": 3,
            "обладает адекватной самооценкой": 3,
            "трезво смотрит на свои возможности": 2,
            "реалистично оценивает себя": 3,
            "знает свои силы": 2,
            "самосознающий": 2,
            "адекватная самооценка": 3,

            # Настойчивый
            "волевой": 2,
            "настойчивый": 1,
            "упорный": 1,
            "целеустремлённый": 1,
            "стойкий": 1,

            # дисциплинированный
            "дисциплинированный": 1,
            "организованный": 1,
            "собранный": 1,

            # Целеустремлённый
            "амбициозный": 1,
            "мотивированный на достижение": 2,
            "идущий к поставленной цели": 2,

            # внимательный
            "внимательный": 1,
            "наблюдательный": 1,
            "сосредоточенный": 1,

            # сообразительный
            "сообразительный": 2,
            "находчивый": 2,
            "проницательный": 2,
        }
    },
    "Волейбол": {
        "keywords": {
            "max_score": 65,
            # Коммуникабельный
            "коммуникабельный": 2,
            "общительный": 2,
            "открытый в общении": 2,

            # активный
            "активный": 1,
            "энергичный": 2,
            "динамичный": 2,

            # уравновешенный
            "уравновешенный": 1,
            "эмоционально стабильный": 1,
            "спокойный": 1,
            "стрессоустойчивый": 1,
            "владеет эмоциями": 2,
            "не сбивается после ошибки": 3,

            # инициативный
            "инициативный": 1,
            "предприимчивый": 2,
            "находчивый": 2,

            # Оптимистичный
            "оптимистичный": 2,
            "жизнерадостный": 2,
            "позитивно настроенный": 2,
            "уверенный в успехе": 2,
            "бодрый духом": 2,

            # дисциплинированный
            "дисциплинированный": 1,
            "собранный": 1,
            "ответственный": 1,

            # командный
            "командный": 1,
            "сплочённый": 2,
            "кооперативный": 2,

            # адаптивный
            "адаптивный": 2,
            "гибкий": 2,
            "легко осваивающий новое": 2,
            "переключается быстро": 3,
            "меняет роль мгновенно": 3,
            "тактически гибкий": 2,

            # упорный
            "упорный": 1,
            "целеустремлённый": 1,
            "терпеливый": 1,
            "не сдающийся перед трудностями": 2,
            "настойчивый": 1,

            # Умеет управлять эмоциями
            "умеет управлять эмоциями": 2,
            "сдержанный": 1,

            # трудолюбивый
            "трудолюбивый": 1,
            "усердный": 1,
            "работоспособный": 1,
            "старательный": 1,
            "преданный делу": 1,
        }
    },
    "Плавание": {
        "max_score": 60,
        "keywords": {

            # предпочитает индивидуальную работу
            "предпочитает индивидуальную работу": 3,
            "работает лучше в одиночку": 3,
            "не нуждается в других": 3,
            "самостоятелен в выполнении задач": 3,
            "эффективен без внешнего контроля": 3,
            "самодостаточный": 2,
            "не зависит от мнения других": 2,
            "независимый в действиях": 2,
            "принимает решения без совета": 2,
            "ориентированный на личный результат": 2,
            "не соревнуется с другими": 2,
            "сравнивает себя только с собой": 2,
            "способный работать в одиночку": 2,
            "комфортно чувствует себя в изоляции": 2,
            "не испытывает дискомфорта в одиночестве": 2,
            "не трудно быть одному": 2,
            "устойчив к монотонной работе": 3,
            "не устаёт от повторений": 3,
            "находит удовлетворение в цикличности": 3,
            "не устает от монотонии": 2,
            "любит когда ему все известно": 2,
            "наслаждается предсказуемостью движений": 2,
            "сосредоточен на процессе, а не на результате": 2,
            "ценит путь, а не цель": 2,

            # эмоционально уравновешенный
            "эмоционально уравновешенный": 2,
            "внутренне стабильный": 2,
            "вннешне спокойный": 2,
            "сдержанный": 1,
            "спокойный": 1,
            "не реагирует импульсивно": 2,
            "самоконтроль": 2,
            "не позволяет эмоциям управлять собой": 2,
            "владеет собой": 2,
            "управляет внутренним состоянием": 2,

            # Дисциплинированный
            "дисциплинированный": 1,
            "следует распорядку": 1,
            "соблюдает правила без напоминаний": 1,
            "собранный": 1,
            "сфокусирован": 1,
            "организованный": 1,
            "планирует заранее": 1,
            "не любит неожиданности": 1,

            # терпеливый
            "терпеливый": 1,
            "выносливый": 1,
            "не сдается на полпути": 2,
            "упорный": 1,
            "не отступает перед усталостью": 2,
            "продолжает, несмотря на трудности": 1,
            "устойчив к рутине": 3,
            "не утомляется однообразием": 3,
            "находит смысл в повторении": 3,

            # увлечённый
            "увлечённый": 2,
            "полностью погружён в дело": 2,
            "преданный делу": 1,
            "мотивированный": 1,
            "внутренняя мотивация": 3,
            "работает ради себя, а не ради других": 3,
            "не стремится к признанию": 3,
            "его цель — самореализация": 3,
            "не нуждается во внешней похвале": 2,

            # целеустремлённый
            "целеустремлённый": 1,
            "идёт к цели, не сворачивая": 1,
            "идёт к своей цели": 1,
            "волевой": 2,
            "сильная воля": 2,
            "преодолевает слабость": 2,
            "идущий к поставленной цели": 2,

            # Интроверт
            "замкнутый": 3,
            "внутренний мир": 3,
            "сохраняет личное пространство": 3,
            "сосредоточен на себе": 2,
            "анализирует свои действия": 2,
            "в тишине восстанавливает силы": 2,
            "предпочитает одиночество шуму": 2,
            "избегает больших компаний": 2,
            "чувствует себя скованно в толпе": 2,
            "не любит большие компании": 2,
            "чувствует себя комфортно в тишине": 2,
            "предпочитает одиночество шуму": 2,
            "избегает больших компаний": 2,
            "чувствует себя комфортно в тишине": 2,

            # Мотивация
            "внутренняя мотивация": 3,
            "мотивирован изнутри": 3,
            "не нуждается в одобрении": 3,
            "работает ради себя": 3,
        }
    },

    "Фигурное катание": {
        "max_score": 70,
        "keywords": {
            # умеет фокусироваться
            "умеет фокусироваться": 2,
            "сконцентрированный": 2,
            "концентрация": 2,
            "фокус": 2,
            "сосредоточенный": 2,
            "внимание": 2,
            "погружён в задачу": 2,

            # эмоционально устойчив
            "эмоционально устойчив": 1,
            "выдержанный": 2,
            "спокойный под давлением": 1,
            "стрессоустойчивый": 1,
            "выступает под давлением": 3,
            "публично устойчивый": 3,
            "внешне сдержан": 2,
            "контролирует проявления": 2,

            # внимательный
            "внимательный": 1,
            "наблюдательный": 1,
            "чуткий к деталям": 3,
            "проницательный": 2,

            # сдержанный
            "сдержанный": 1,
            "владеющий собой": 2,
            "эмоционально регулируемый": 2,
            "собранный": 1,

            # стойкий
            "стойкий": 1,
            "выносливый": 1,
            "упорный": 1,
            "терпеливый": 1,
            "не отступающий перед трудностями": 2,

            # дисциплинированный
            "дисциплинированный": 1,
            "системный": 2,
            "методичный": 2,
            "следует плану": 2,

            # трудолюбивый
            "трудолюбивый": 1,
            "усердный": 1,
            "работоспособный": 1,

            # комфортно чувствует себя на публике
            "комфортно чувствует себя на публике": 3,
            "выразительный в рамках": 2,
            "уверенный в выступлениях": 2,
            "харизматичный на публике": 2,
            "харизматичный": 2,
            "комфортно чувствует себя на сцене": 3,
            "испытывает удовольствие от зрительского внимания": 2,
            "работает на публику": 2,
            "воспринимает выступление как творчество": 3,

            # предпочитает стабильность
            "предпочитает стабильность": 3,
            "стабильный": 2,
            "предпочитает порядок": 3,
            "не любит импровизацию": 3,
            "планирует заранее": 3,
            "последовательный": 2,
            "избегает хаотичных ситуаций": 2,
            "не выносит непредсказуемости": 2,
            "требует чёткой структуры": 2,
            "предпочитает заранее составленные планы": 2,

            # организованный
            "организованный": 1,
            "структурированный": 2,
            "упорядоченный": 2,
            "методичный": 2,
            "собранный": 1,

            # предпочитает планирование
            "предпочитает планирование": 3,
            "предусмотрительный": 2,
            "расчётливый": 2,
            "системно мыслящий": 2,
            "заранее продумывающий шаги": 2,
        }
    },


    "Тяжелая атлетика": {
        "max_score": 55,
        "keywords": {
            # эмоционально устойчивый
            "эмоционально устойчивый": 1,
            "стрессоустойчивый": 1,
            "уравновешенный": 1,
            "спокойный под нагрузкой": 3,
            "эмоционально стабильный": 1,
            "рассудительный": 1,

            # добросовестный
            "добросовестный": 1,
            "ответственный": 1,
            "исполнительный": 1,
            "порядочный в делах": 1,

            # самодисциплинированный
            "самодисциплинированный": 3,
            "организованный": 1,
            "собранный": 1,

            # целеустремлённый
            "целеустремлённый": 1,
            "амбициозный": 1,
            "волевой": 2,
            "мотивированный": 1,

            # сконцентрированный
            "сконцентрированный": 2,
            "концентрация": 2,
            "сосредоточенный": 2,
            "умеющий фокусироваться": 2,
            "фокус на одном": 3,
            "методичный": 2,
            "терпеливый": 1,

            # упорный
            "упорный": 1,
            "стойкий": 1,
            "несгибаемый": 2,
            "сила воли": 3,
            "не сдаётся": 3,
            "преодолевает": 2,
            "решительный": 1,
        }
    },

    "Фехтование": {
        "max_score": 65,
        "keywords": {
            # креативный
            "креативный": 3,
            "изобретательный": 2,
            "нестандартно мыслящий": 3,
            "с богатым воображением": 2,
            "находчивый": 2,

            # склонен экспериментировать
            "склонен экспериментировать": 3,
            "открытый новому": 2,
            "ищущий нестандартные решения": 3,
            "готовый к пробным действиям": 2,
            "исследовательски настроенный": 2,
            "любит импровизировать": 2,
            "творчески подходит к задачам": 2,
            "избегает шаблонных решений": 2,
            "ищет нестандартные формы выражения": 2,

            # гибкий в принятии решений
            "гибкий в принятии решений": 2,
            "адаптивный": 2,
            "быстро ориентирующийся": 2,
            "оперативно реагирующий на изменения": 2,
            "способный менять тактику": 2,
            

            # ответственный
            "ответственный": 1,
            "надёжный": 1,
            "добросовестный": 1,
            "исполнительный": 1,
            "сознательный": 1,

            # обладает высоким самоконтролем
            "обладает высоким самоконтролем": 2,
            "сдержанный": 1,
            "эмоционально регулируемый": 2,
            "собранный": 1,

            # настойчивый
            "настойчивый": 1,
            "упорный": 1,
            "целеустремлённый": 1,

            # артистичный
            "артистичный": 3,
            "выразительный": 2,
            "обладающий эстетическим чувством": 2,
            "изящный в движениях": 2,
            "сценически одарённый": 2,
            "эмоционально выразительный": 3,
            "стремится к художественному воплощению": 3,
            "создаёт образ через движение": 3,

            # внимательный
            "внимательный": 1,
            "наблюдательный": 1,
            "бдительный": 1,
            "сосредоточенный на деталях": 2,
            "проницательный": 2,

            # эмоционально устойчив
            "эмоционально устойчив": 1,
            "стрессоустойчивый": 1,
            "спокойный под давлением": 1,

            # аналитичный
            "аналитичный": 2,
            "логически мыслящий": 2,
            "рассудительный": 1,
            "умеющий разбирать ситуацию на составляющие": 2,
            "системно анализирующий": 2,

            # стратегически мыслящий
            "стратегически мыслящий": 2,
            "дальновидный": 2,
            "планирующий на несколько шагов вперёд": 2,
            "предусмотрительный": 2,
            "расчётливый": 2,

            # смелый
            "смелый": 2,
            "отважный": 2,
            "бесстрашный": 2,
            "решительный": 1,
            "не боящийся вызовов": 2,

            # авантюрный
            "авантюрный": 3,
            "склонный к рискованным решениям": 3,
            "любящий острые ощущения": 2,
            "смелый в экспериментах": 2,
            "готовый идти на обоснованный риск": 2,

            # инициативный
            "инициативный": 1,
            "активный": 1,
            "предлагающий новые идеи": 2,
        }
    },
    "Шахматы": {
        "max_score": 60,
        "keywords": {
            # спокойный
            "спокойный": 1,
            "уравновешенный": 1,
            "сдержанный": 1,
            "невозмутимый": 2,

            # аналитичный
            "аналитичный": 2,
            "логически мыслящий": 2,
            "проницательный": 2,
            "системный в оценках": 2,
            "аналитический склад ума": 3,
            "разбирает ситуацию на части": 2,
            "ищет логические связи": 2,
            "основывается на фактах, а не на эмоциях": 2,
            "анализирует, прежде чем действовать": 2,

            # стратегически мыслящий
            "стратегически мыслящий": 2,
            "дальновидный": 2,
            "планирующий на много ходов вперёд": 3,
            "предусмотрительный": 2,
            "расчётливый": 2,
            "стратегически мыслит": 3,
            "просчитывает на несколько шагов вперёд": 3,
            "оценивает все варианты": 2,
            "выбирает оптимальное решение": 2,
            "мыслит системно": 2,

            # усидчивый
            "усидчивый": 3,
            "устойчивый к длительной работе": 2,
            "терпеливый к монотонности": 2,
            "способный к длительной концентрации": 2,
            "выносливый в умственной работе": 2,

            # эмоционально устойчивый
            "эмоционально устойчивый": 1,
            "стрессоустойчивый": 1,
            "сохраняющий самообладание": 2,
            "спокойный под давлением": 1,

            # сосредоточенный
            "сосредоточенный": 2,
            "сконцентрированный": 2,
            "умеющий фокусироваться": 2,
            "погружённый в задачу": 2,

            # организованный
            "организованный": 1,
            "систематический": 2,
            "структурированный": 2,
            "методичный": 2,
            "соблюдающий порядок": 2,

            # терпеливый
            "терпеливый": 1,
            "выносливый": 1,

            # рациональный
            "рациональный": 2,
            "логичный": 2,
            "объективный": 2,
            "основывающийся на фактах": 2,

            # рассудительный
            "рассудительный": 1,
            "вдумчивый": 1,
            "осмотрительный": 1,
            "ценит логику выше эмоций": 2,
            "порядок важнее хаоса": 2,
            "побеждает умом, а не силой": 3,

            # осторожный
            "осторожный": 2,
            "предусмотрительный": 2,
            "бдительный": 1,
            "не подвержен импульсивным решениям": 2,
            "избегает поспешных выводов": 2,
            "взвешивает каждое действие": 2,

            # сосредоточен на внутреннем процессе
            "сосредоточен на внутреннем процессе": 3,
            "интровертный в мышлении": 3,
            "погружённый в размышления": 2,
            "концентрированный на анализе": 2,
        }
    },
    "Хоккей": {
        "max_score": 60,
        "keywords": {
            # эмоционально устойчивый
            "эмоционально устойчивый": 1,
            "стрессоустойчивый": 1,
            "спокойный в сложных ситуациях": 2,

            # сосредоточенный
            "сосредоточенный": 2,
            "сконцентрированный": 2,
            "умеющий фокусироваться": 2,

            # внимательный
            "внимательный": 1,
            "наблюдательный": 1,
            "бдительный": 1,

            # проницательный
            "проницательный": 2,
            "сообразительный": 2,
            "быстро оценивающий ситуацию": 2,

            # решительный
            "решительный": 1,
            "непоколебимый": 2,
            "смелый в выборе": 2,

            # смелый
            "смелый": 2,
            "не боящийся столкновений": 2,

            # настойчивый
            "настойчивый": 1,
            "упорный": 1,
            "целеустремлённый": 1,
            "твёрдо идущий к цели": 2,

            # инициативный
            "инициативный": 1,
            "активный": 1,

            # обладает высокой выдержкой
            "обладает высокой выдержкой": 2,
            "стойкий": 1,

            # командный
            "командный": 1,
            "ориентированный на коллективные цели": 2,
            "умеющий взаимодействовать": 2,
            "сплочённый": 2,
            "партнёрский": 2,
            "командный игрок": 2,
        }
    },
    "Теннис": {
        "max_score": 55,
        "keywords": {
            # коммуникабельный
            "коммуникабельный": 2,
            "общительный": 2,
            "легко идёт на контакт": 2,
            "открытый в общении": 2,

            # эмоционально устойчивый
            "эмоционально устойчивый": 1,
            "стрессоустойчивый": 1,
            "спокойный под давлением": 1,

            # рассудительный
            "рассудительный": 1,
            "вдумчивый": 1,
            "осмотрительный": 1,
            "взвешивающий решения": 2,

            # упорный
            "упорный": 1,
            "настойчивый": 1,
            "стойкий": 1,
            "не сдающийся перед трудностями": 2,

            # умеет владеть собой
            "умеет владеть собой": 2,
            "сдержанный": 1,
            "собранный": 1,

            # целеустремлённый
            "целеустремлённый": 1,
            "нацеленный на результат": 2,
            "амбициозный": 1,
            "мотивированный": 1,
            "волевой": 2,

            # решительный
            "решительный": 1,
            "твёрдый в решениях": 2,
            "смелый в действиях": 2,

            # ответственный
            "ответственный": 1,
            "надёжный": 1,
            "добросовестный": 1,

            # рациональный
            "рациональный": 2,
            "логичный": 2,
            "рассудочный": 1,

            # организованный
            "организованный": 1,
            "систематический": 2,
            "структурированный": 2,
            "методичный": 2,
        }
    },
    "Конный спорт": {
        "max_score": 55,
        "keywords": {
            # самостоятельный
            "самостоятельный": 2,
            "независимый в решениях": 2,
            "умеющий действовать в одиночку": 2,

            # уравновешенный
            "уравновешенный": 1,
            "эмоционально стабильный": 1,
            "спокойный": 1,
            "сдержанный": 1,

            # рассудительный
            "рассудительный": 1,
            "вдумчивый": 1,
            "осмотрительный": 1,

            # независимый
            "независимый": 2,
            "самостоятельный в суждениях": 2,

            # стрессоустойчивый
            "стрессоустойчивый": 1,
            "сохраняющий самообладание": 2,
            "устойчивый к давлению": 2,

            # обладающий самоконтролем
            "обладающий самоконтролем": 2,
            "дисциплинированный": 1,
            "умеющий регулировать эмоции": 2,

            # способен к глубокому партнёрскому взаимодействию с животным
            "способен к партнёрскому взаимодействию с животным": 3,
            "эмпатичный к животному": 3,
            "умеющий выстраивать доверительные отношения": 2,

            # ответственный
            "ответственный": 1,
            "надёжный": 1,
            "добросовестный": 1,
            "сознательный": 1,

            # открытый
            "открытый": 2,
            "дружелюбный": 2,
            "коммуникабельный": 2,
            "располагающий к себе": 2,
            "искренний": 2,

            # решительный
            "решительный": 1,
            "твёрдый в действиях": 2,
            "смелый в принятии решений": 2,
            "непоколебимый": 2,
            "быстро реагирующий": 2,
        }
    }
}